Natural_Reef_CFD/highRelief/Scenario_59/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 3;
        cAlpha          1;

        MULESCorr       yes;
        nLimiterIter    3;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;
    }

    pcorrFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        tolerance       1e-5;
        relTol          0.01;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 500; //sqrt(number of cells)
        mergeLevels     1;
        minIter         3;
/*        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;*/
    }

    p_rghFinal
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 500;
        mergeLevels     1;
        minIter         3;
/*        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0;*/
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        minIter         1;
        // maxIter         200;
        relTol          0;
    }

    UFinal
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        minIter         1;
        // maxIter         200;
        relTol          0;
    }

    "(k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }

    "(k|epsilon)Final"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nCorrectors     1;
    nOuterCorrectors    100;
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        U
        {
            tolerance   1e-5;
            relTol      0;
        }
        p_rgh
        {
            tolerance   1e-3;
            relTol      0;
        }
        k
        {
            tolerance   1e-5;
            relTol      0;
        }
        epsilon
        {
            tolerance   1e-5;
            relTol      0;
        }
    }
}

relaxationFactors
{
    fields
    {
        p_rgh       0.3;
        p_rghFinal  1;
    }
    equations
    {
        U           0.7;
        "(k|epsilon)" 0.7;
        "(U|k|epsilon)Final" 1;
    }
}
// ************************************************************************* //
